// // object -> {}
//
// // {
// // key : elements
// // }
//
// let names = [
//     {
//         id: 1,
//         name: "Alisher",
//         age: 21
//     },
//     {
//         id: 2,
//         name: "Aitemir",
//         age: 17
//     },
//     {
//         id: 3,
//         name: "Kalysbek",
//         age: 17
//     },
//     {
//         id: 4,
//         name: "Perizat",
//         age: 18
//     },
//     {
//         id: 5,
//         name: "Baiaman",
//         age: 15
//     }
// ]
//
// let test = {
//     id: 0,
//     title: "text",
//     image: {
//         png: "text",
//         svg: "title",
//         pdf: {
//             name: "gbr"
//         }
//     }
// }
//
// let me = [
//     {
//         id: 1,
//         name: "My name",
//         age: 11,
//         car: null,
//         jobs: {
//             mentor: "It-space academy",
//             developer: "Gold Company"
//         },
//         family: {
//             dad: "",
//             mom: "",
//             sister: ""
//         },
//         education: 'average',
//         hobby: {
//             one: "tennis",
//             two: "football"
//         },
//         friends: {
//             one: "azi",
//             two: "baha"
//         }
//     }
// ]
//
// console.log(me)


// 1. Создайте массив чисел и
// используйте цикл for для
// вывода каждого элемента.

// let arr =[1,2,3]
// for (let i = 0;i < arr.length;  i++){
//     console.log(arr[i])
// }

//
// 2. Создайте объект с несколькими
// ключами и значениями,
// затем используйте цикл
// for...in для перебора ключей.
//

// 3. Используйте метод map
// для удвоения каждого
// элемента в массиве чисел.
//
// let numbers = [2,7,12,9,32,25]
// let result = numbers.map(el =>{
//     return el * 2
// })
// console.log(result)

// 4. Используйте метод filter,
// чтобы отфильтровать четные
// числа из массива.

// let arr=[23,45,67,89,40,50,46]
// let result=arr.filter(el=>{
//     return el%2===0
// })
// console.log(result)

// 5. Создайте функцию, использующую
// метод reduce, чтобы найти
// сумму всех чисел в массиве.



// 6. Отсортируйте массив чисел
// по возрастанию с помощью sort.
//
// 7. Используйте метод Math.random()
// для генерации случайного числа.

// 8. Преобразуйте строку в число,
// используя метод parseInt или parseFloat.

// 9. Создайте функцию, которая
// принимает число и возвращает
// его квадрат.

// 10. Используйте метод Array.isArray()
// для проверки, является
// ли переменная массивом.

// 11. Найдите максимальное
// число в массиве с помощью
// метода Math.max().

// 12. Используйте метод Array.from()
// для создания массива из строки.

// 13. Создайте функцию, которая
// принимает массив чисел и
// возвращает новый массив
// с кубами этих чисел.

// 14. Используйте метод String.fromCharCode()
// для преобразования числа
// в соответствующий символ Unicode.

// 15. Найдите среднее значение
// чисел в массиве.

// 16. Преобразуйте массив строк
// в одну строку с помощью
// метода join.

// 17. Используйте метод
// Array.prototype.every()
// для проверки, все ли элементы
// массива больше нуля.

// 18. Создайте функцию, которая
// принимает строку и возвращает
// её длину.

// 19. Используйте метод
// Array.prototype.some()
// для проверки, есть ли хотя
// бы один четный элемент в массиве.

// 20. Округлите число до ближайшего
// целого с помощью метода Math.round().
